Notes on dissipation of energy in turbulent flows

*** Relationship between ionization parameter U and radiation parameter \Xi
:PROPERTIES:
:ID:       EE3830D5-75C8-41DE-AFA1-0B9130776009
:END:
- \Xi \equiv P_rad / P_gas = L / (4 \pi R^2 c (2 n k T))
- \Xi / U = L / Q 2 k T
  - L / Q \equiv k T'
    | Star |   L_4 |     Q_49 |    T' | \Xi / U T_4 |
    |------+------+---------+-------+-----------|
    | MS10 | 0.63 | 0.00013 | 1.3e8 |     6.5e3 |
    | MS20 | 5.45 |    0.16 | 9.4e5 |     4.7e1 |
    | MS40 | 22.2 |    1.41 | 4.4e5 |     2.2e1 |
    | BSG  | 30.2 |   0.016 | 5.2e7 |     2.6e3 |
   #+TBLFM: $4=$2 1e4 $lsun / $3 1e49 $k;s2::$5=$4  / 2 1e4;s2
    - At first it seemed weird that these values are so high (but this is now all resolved, see below)
    - For the cooler stars, f_euv is very low, which gives large ratios
  - For Orion, assuming Q=1e49, L=2e5 L_sun, we have T' = 5.5e5 K, \Xi / U = T' / 2 T = 32 (assuming T=8500 K)
- Alternative way of putting it:
  - Equivalent T of 1 Rydberg is 1.58e5 K
  - We can write L = L_fuv + L_euv = L f_fuv + Q \langle{}E\rangle_euv
    - where \langle{}E\rangle_euv is the average energy of an ionizing photon
    - f_fuv is fraction of bolometric luminosity emitted in the FUV and longer wavelengths
    - Probably clearer to write f_euv = 1 - f_fuv with f_euv the fraction of bolometric luminosity emitted in the EUV and shorter wavelengths
    - => L = Q \langle{}E\rangle_euv / f_euv
  - Also put \langle{}E\rangle_euv = e_\star k T_ryd where e_\star is the average ionizing photon energy in Rydbergs and T_ryd is the temperature equivalent to 1 Rydberg (1.58e5 K)
- So, getting back to the relation between radiation parameter and ionization parameter:
  - \Xi / U = L / Q 2 k T = (Q e_\star k T_ryd) / (f_euv Q 2 k T)
  - \Xi / U = (e_\star T_ryd) / (f_euv 2 T)
  - *\Xi / U = 15.8 (e_\star / f_euv) T_4^-1*
